{
	"_id": "lp5ZpYjbFhe8IUcx",
	"_key": "!items!lp5ZpYjbFhe8IUcx",
	"effects": [
	],
	"folder": "UhkYXOiI4MqoQthG",
	"img": "systems/fallout/assets/icons/items/apparel.svg",
	"name": "Armor Frame",
	"system": {
		"appareltype": "powerArmor",
		"armorType": "",
		"cost": 4500,
		"damaged": "",
		"description": "<p>The standard armor frame is a West Tek powered exoskeleton. It draws power from a back-mounted TX-28 micro-fusion reactor, which is compatible with standard fusion cores (p.94). An armor frame cannot be modded.</p>\n<ul>\n<li><strong>Operation:</strong> Entering or leaving an armor frame requires a major action. The armor consumes a single charge from its fusion core at the end of each scene it is used in. If this would reduce the fusion core to 0 charges, then the frame becomes unpowered. Complications on <strong>Athletics</strong> tests made while operating the Power Armor may result (at the GM&rsquo;s discretion) in extra charges being used, as strenuous activity consumes power more quickly.</li>\n<li><strong>Impact Landing:</strong> A character wearing Power Armor suffers no damage for falling or jumping down any height. In fact, landing from any height higher than a single-story building inflicts 3 @fos[DC] damage to any creatures (or other damageable objects) within Reach of you when you land. This applies even if the armor is unpowered.</li>\n<li><strong>Enhanced Strength:</strong> A character wearing Power Armor uses the armor frame&rsquo;s <strong>STR</strong> of 11 instead of their own, for all purposes (such as skill tests, carry weight, and melee damage bonus). In addition, the weight of the armor frame and any attached armor pieces is not counted towards the wearer&rsquo;s carry weight. These benefits are lost if the armor is unpowered.</li>\n<li><strong>Sealed Environment:</strong> So long as the armor is sealed (it has components for each location, and none of those components are damaged), it provides a breathable atmosphere, allowing the wearer to survive underwater, in toxic gas, or similar inhospitable conditions. This benefit is lost if the armor is unpowered.</li>\n<li><strong>Ablative Resilience:</strong> When a character in Power Armor is attacked or otherwise suffers damage, then the damage is reduced by the damage resistances of the armor piece on that location, and any remaining damage marks off the armor piece&rsquo;s Health points. If an armor piece would suffer a Critical Hit (5+ damage in one hit), or is reduced to 0 HP, then it is <strong>damaged</strong>. Damaged armor pieces no longer provide protection&mdash;hits to that location strike the wearer instead&mdash;using the wearer&rsquo;s damage resistances and HP.</li>\n<li><strong>Technological:</strong> Armor pieces do not regain HP naturally, and cannot be restored using Stimpaks or the <strong>Medicine</strong> skill. They must be repaired, in the same way as robots (p.34). Power Armor is affected by any effect which targets or affects machines or robots.</li>\n</ul>\n<p>&nbsp;</p>",
		"equippable": true,
		"equipped": false,
		"favorite": false,
		"health": {
			"max": 0,
			"min": 0,
			"mod": 0,
			"value": 0
		},
		"location": {
			"armL": true,
			"armR": true,
			"head": true,
			"legL": true,
			"legR": true,
			"torso": true
		},
		"mods": {
			"current": 0,
			"list": "",
			"max": 0
		},
		"powerStr": 11,
		"powerSystems": {
			"current": 0,
			"list": "",
			"max": 0
		},
		"powered": false,
		"quantity": 1,
		"rarity": 4,
		"resistance": {
			"energy": 0,
			"physical": 0,
			"radiation": 0
		},
		"source": "",
		"special": "",
		"stashed": false,
		"weight": 150
	},
	"type": "apparel"
}
