{
	"_id": "auV5NLfnrA5zUr9q",
	"_key": "!journal.pages!7650UDxM6aehgB21.auV5NLfnrA5zUr9q",
	"image": {
	},
	"name": "Release Notes",
	"src": null,
	"system": {
	},
	"text": {
		"content": "<h1>v11.4.0</h1>\n\n<h2>Enhancements</h2>\n\n<ul><li><p>[#141] Add ability to specify Normal, Mighty/Notable, Legendary/Major categories on Creature and NPC sheets</p><ul><li>The migration script will attempt to work out which category an NPC should be by correlating its level and XP reward.  If that&#39;s not possible a warning message will prompt you so you can manually check individual NPC sheets and set the correct category.</li></ul></li><li><p>[#142] Auto-calculate XP reward for NPCs</p><ul><li>This field is now read-only and autocalculated from the Creature or NPC&#39;s Level and Category</li></ul></li><li><p>[#143] Allow configuration of thirst reduction on food consumables in order to handle Soups/Stews</p></li><li>[#145] Add new Weapon Qualities from Fallout Wanderer&#39;s Guide</li><li>[#149] Add default icons for all item types</li><li>[#150] Add new default tokens for all actor types</li><li>[#152] Added Addiction item compendium (12 items)</li><li>[#153] Added Ammunition item compendium (20 items)</li><li>[#154] Added Apparel item compendium (161 items)</li><li>[#155] Added Apparel Mods item compendium (161 items)</li><li>[#156] Added Books and Magazines item compendium (95 items)</li><li>[#157] Added Consumable item compendium (137 items)</li><li>[#161] Added Trait item compendium (10 items)</li><li>[#162] Added Weapons item compendium (68 items)</li><li>[#163] Added Weapon Mods item compendium (145 items)</li><li>[#171] Add new text enricher to detect +/-nCD or +/-nDc (where +/- is an optional symbol, and <code>n</code> is a number) and format the string with the Combat Dice icon</li></ul>\n\n<h2>Bugfixes</h2>\n\n<ul><li>[#144] Add conversion Lbs/Kgs for Materials</li><li>[#147] Skill names not localized in skill roll chat messages</li><li>[#165] Show correct weight system on encumbrance bar when system is set to Kg</li><li>[#173] Inline rolls almost unreadable on item chat cards and sheet descriptions</li></ul>\n\n<h2>Chores</h2>\n\n<ul><li>[#174] Tidy up Weapon Quality and Damage Effect data in schema</li><li><p>[#175] Retire the hovers.json facility as we are allowed to have this information in the i18n files for use in tooltips</p><ul><li>If you are able, please help out with translating these new tooltips (and other strings) via the <a href=\"https://crowdin.com/project/foundryvtt-fallout\">Crowdin Project</a>.</li></ul></li></ul>\n\n<p><em>Many thanks to Modiphius for allowing the inclusion of player facing item compendiums which contain various classes of item from the core rulebook.</em></p>\n\n<hr/>\n\n<h1>v11.3.6</h1>\n\n<h2>Bugfixes</h2>\n\n<ul><li>[#137] Ammo counting code can incorrectly match non-ammo items</li><li>[#138] Character sheet rendered before all data ready</li></ul>\n\n<hr/>\n\n<h1>v11.3.5</h1>\n\n<h2>Bugfixes</h2>\n\n<ul><li>[#128] Modifying Creature actors fails</li></ul>\n\n<h2>Chores</h2>\n\n<ul><li>[#127] Merge localization updates from Crowdin</li></ul>\n\n<hr/>\n\n<h1>v11.3.4</h1>\n\n<h2>Bugfixes</h2>\n\n<ul><li>[#125] Updating NPC name doesn&#39;t get reflected immediately in a related settlement sheet</li></ul>\n\n<hr/>\n\n<h1>v11.3.3</h1>\n\n<h2>Enhancements</h2>\n\n<ul><li>[#120] Group settlement stockpile items by type</li></ul>\n\n<h2>Bugfixes</h2>\n\n<ul><li>[#121] Settler data getting corrupted after adding six or more</li></ul>\n\n<h2>Chores</h2>\n\n<ul><li>[#118] Merged more language updates from Crowdin</li></ul>\n\n<p><em>The French translation is now 100% complete.  Many thanks to Starbuck for their work on this.</em></p>\n\n<hr/>\n\n<h1>v11.3.2</h1>\n\n<h2>Chores</h2>\n\n<ul><li>[#113] Merged language updates from Crowdin</li></ul>\n\n<hr/>\n\n<h1>v11.3.1</h1>\n\n<h2>Bugfix</h2>\n\n<ul><li>[#110] Migrations not running correctly</li></ul>\n\n<hr/>\n\n<h1>v11.3.0</h1>\n\n<h2>Enhancements</h2>\n\n<ul><li>[#13] Add new Settlement Actor and corresponding sheet</li><li><p>[#37] The following character sheet fields are now auto-calculated and have new variables that can be used to adjust them with Active Effects if needed:</p><ul><li><strong>Defense</strong> (adjusted by <code>system.defense.bonus</code>)</li><li><strong>Max Health</strong> (adjusted by <code>system.health.bonus</code>)</li><li><strong>Initiative</strong> (adjusted by <code>system.initiative.bonus</code>)</li><li><strong>Melee Damage</strong> (adjusted by <code>system.meleeDamage.bonus</code>)</li><li><strong>Next Level XP</strong> (<em>no adjustment available</em>)</li></ul></li><li><p>[#38] Automatically set the initiative for actors added to the combat tracker</p></li><li>[#43] Add support for ammo types that have multiple charges/shots per item</li><li>[#45] Added Junk, Common, Uncommon and Rare Material numeric fields to character sheet</li><li>[#50] Display the system release notes the first time a world is loaded in a new version of the system</li><li>[#55] Show the amount of remaining shots for each favourite weapon on the status page</li><li>[#59] Added new Trait item and display them on the character sheet along with Perks</li><li>[#61] Changes to Dialog2d20 class to help with possible module integrations (thanks to AngryBeaver of Beaver&#39;s Crafting fame)</li><li><p>[#69] Add ability to consume Consumable items and adjust thirst, hunger, hp, rads, etc. accordingly.</p><ul><li>This handles HP/Radiation damage healing, Chem addiction rolls, and also adjusts Hunger and Thirst levels appropriately.  Any other effects still need to be handled manually at the moment.</li></ul></li><li><p>[#71] Add new Intoxication condition field to help track the amount of alcoholic beverages consumed during a session</p></li><li>[#75] Add Radiation Healed field to Consumable items, as they are all potentially able to heal Radiation damage</li><li>[#77] Seperate consumable addictive field into a boolean Addictive checkbox and a numeric Addiction Number for clarity</li><li>[#78] Add new Addiction item type, similar to Disease items, and displayed on the Status screen</li><li><p>[#81] Non-Character weight calculations</p><ul><li>NPCs and Creatures both now have their inventory weights calculated, and you are now able to set a carry capacity on Creatures</li></ul></li><li><p>[#85] Add Macro to start a new game session</p><ul><li>This is called <strong>&quot;New Session&quot;</strong> and it resets the Party AP to zero, sets the GM AP to the number of players and resets the Intoxication (the number of alcoholic drinks consumed by the player during a session) and Chem Dose counters to zero ready for a new game session</li></ul></li><li><p>[#86] Add group field to Consumable items to allow for different items sharing the same addiction name</p></li><li>[#87] Add flag to show whether food consumable items count as prepared or not</li><li><p>[#88] Switch Chem consumable&#39;s Duration field to a drop-down</p><ul><li>The migration script for this change will attempt to determine which Duration to use, but this will only work for non-abbreviated English language names that match (in a non-case-sensitive way) the names of these durations somewhere in the string.  Any items whose duration can&#39;t be migrated will be given the template default of &quot;instant&quot;.</li></ul></li><li><p>[#91] Add Thirst Reduction value to Beverage consumables</p></li><li><p>[#92] Create new interface for managing the amount of Chem doses a character has taken this session</p><ul><li>This can be accessed by clicking the &quot;pill&quot; button in the Addictions table list (character sheet Status tab).  If the character already owns an &quot;Addiction&quot; item with the same name as the Chem (or Chem Group for Chems which share the same addiction), then rolls for addiction are no longer made</li></ul></li><li><p>[#94] Add new item type for settlement Objects and Structures</p></li><li>[#99] Lock and add tooltips to sheet fields that are being overridden by active effects</li></ul>\n\n<h2>Bugfixes</h2>\n\n<ul><li>[#34] Weapon Qualities and Damage Effects should be displayed in (localised) alphabetical order on Weapon item sheet</li><li>[#51] Item quantity boxes polluting actor data when altered</li><li>[#60] Use localized skill names to sort and display alphabetically on Character sheet</li><li>[#65] Stash button alignment issue on Character sheet Apparel tab</li><li>[#66] Power Armor health status showing values when no power armor in use</li><li>[#68] New Consumable item sheet defaults to Food, but Food parameters not shown until selection changed</li><li>[#70] Consumable chat card shows irrelevant details</li><li>[#72] Consumable <code>system.addictive</code> field should be a numeric</li><li>[#74] Chems are able to heal HP as well, so the field should be available on the item sheet for them</li><li>[#93] Custom skill names not displayed correctly due to i18n translation missing</li></ul>\n\n<h2>Chores</h2>\n\n<ul><li>[#33] Merged Polish language updates from Crowdin</li><li>[#35] Remove usage of deprecated <code>ActiveEffect._getSourceName()</code></li><li>[#36] Remove usage of deprecated <code>ActiveEffect#label</code></li><li>[#46] Implement schema migration tools ready for likely schema changes</li><li>[#64] Add ability to filter item compendiums by source ready for future work</li><li>[#79] Merged some corrected Polish translations (thanks to Sanawabicz)</li><li>[#89] Translate as much as possible of the config at startup</li><li>[#97] Refactor sheet classes to more easily share code without constant type checking</li></ul>\n\n<hr/>\n\n<h1>v11.2.6</h1>\n\n<h2>Bugfixes</h2>\n\n<ul><li>[#27] Text for some item sheets seems to be broken</li><li>[#28] Editing/Deleting items broken due to missing data tag</li><li>[#29] Encumbrance not being calculated correctly</li></ul>\n\n<h2>Chores</h2>\n\n<ul><li>Merged Polish translation updates from Crowdin</li></ul>\n\n<hr/>\n\n<h1>v11.2.5</h1>\n\n<h2>Chores</h2>\n\n<ul><li>Translation updates are now all handled via Crowdin to simplify the process of contributing translations.  See here for more details: https://github.com/Muttley/foundryvtt-fallout/wiki/Other-ways-to-contribute#translation</li></ul>\n\n<hr/>\n\n<h1>v11.2.4</h1>\n\n<h2>Bugfixes</h2>\n\n<ul><li>[#19] Actor skills being overwritten when an Actor is duplicated</li></ul>\n\n<hr/>\n\n<h1>v11.2.3</h1>\n\n<h2>Bugfixes</h2>\n\n<ul><li>[#17] Item preview/expansion on Actor sheets doesn&#39;t display anything</li></ul>\n\n<hr/>\n\n<h1>v11.2.2</h1>\n\n<h1>Bugfixes</h1>\n\n<ul><li>[#14] NPC / Creature inventory items messed up</li></ul>\n\n<h1>Enhancements</h1>\n\n<ul><li>[#15] Tidy up hunger/thirst/sleep selector layout</li></ul>\n\n<hr/>\n\n<h1>v11.2.1</h1>\n\n<h1>Bugfixes</h1>\n\n<ul><li>[#9] AP Tracker not launching</li></ul>\n\n<hr/>\n\n<h1>v11.2.0</h1>\n\n<ul><li>System migrated to new home and build process</li><li>Compendiums now contained within a top-level system folder</li></ul>\n\n<hr/>\n\n<h1>v11.1.0</h1>\n\n<ul><li>Added Weight unit in settings</li><li>Added some translation fix for french</li><li>Changed defense on charater to read defense.value instead of defense.base</li></ul>\n\n<hr/>\n\n<h1>v11.0.3</h1>\n\n<ul><li>Fixed Unstable radiation weapon quality</li></ul>\n\n<hr/>\n\n<h1>v11.0.2</h1>\n\n<ul><li>Added new weapon qualities and damage effects</li><li>Added Polish and Deutsch languages</li></ul>\n\n<hr/>\n\n<h1>v11.0.1</h1>\n\n<ul><li>Foundry v11 compatible</li></ul>\n\n<hr/>\n\n<h1>v10.1.5</h1>\n\n<ul><li>Moved the TextEditor.enrichHTML to getData on the sheet</li></ul>\n\n<hr/>\n\n<h1>v10.1.4</h1>\n\n<ul><li>updated FR translation</li><li>Added a setting where you can define your custom skill compendium that will be used to populate your newly created characters with the skills from that compendium.</li><li>Exposed the APTracker class if you want to make a macro to update gmAP or partyAP (special request by some users).\nYou can now call\n<code>await fallout.APTracker.setAP(&quot;gmAP&quot;, 1)</code> or <code>await fallout.APTracker.setAP(&quot;partyAP&quot;, 1)</code> to set it to the custom value. Change &quot;1&quot; for some value you want.</li></ul>\n\n<hr/>\n\n<h1>v10.1.3</h1>\n\n<ul><li>removed the <strong>max</strong> Foundry version from the system so you can test it on Foundry V11</li><li>small modification to encumbrance so the system.carryWeight.base could be modified by Active Effects</li><li>robot carryWeight modifications from armor is now only taking the equipped and not-stashed parts in to acount</li></ul>\n\n<hr/>\n\n<h1>v10.1.2</h1>\n\n<ul><li>Lowering <strong>max</strong> version from <strong>11</strong> back to <strong>10</strong> since there are some problems in Foundry 11</li><li>Small fix in weapons names (to show if weapon is damaged)</li><li>Adding images and additional info to the Favorite Weapons Box.</li><li>Small styling fixes on the character status tab</li></ul>\n\n<hr/>\n\n<h1>v10.1.1</h1>\n\n<ul><li>Fixed encumbrance display.</li><li>Adding <strong>this.system.unofficalSpeed = Agi + athletics</strong> in derivedData method. This can be used for grided maps and optional grided combat rules.</li><li>Equipped apparel name now shows when you hover &quot;body part status box&quot; on the status screen</li><li><strong>Diseases</strong>. Added <strong>disease</strong> item. Those can also have Active effect on them that can be transfered to actors. Replaced Quick Apparel box on Character sheet with the diseases.</li><li>Improved the styling of chat messages that detail item&#39;s properties</li><li>Added Português (Brasil) translation</li></ul>\n\n<hr/>\n\n<h1>v10.1.0</h1>\n\n<ul><li>Added new Block for Body Parts with resistances and Injuries to the NPC and Creature sheets. Unfortunately there is no way for me to migrate previous data so the resistances and the injuries of NPCs and Creatures must be repopulated.</li></ul>\n\n<hr/>\n\n<h1>v10.0.9</h1>\n\n<ul><li>Added &quot;perks&quot; parameter to Robot Mods.</li><li>Removed the background from the d6 so the color of the die can be customized in Dice So Nice module</li></ul>\n\n<hr/>\n\n<h1>v10.0.8</h1>\n\n<ul><li>Added &quot;Ammo Per Shoot&quot; parameter to weapons.</li></ul>\n\n<hr/>\n\n<h1>v10.0.7</h1>\n\n<ul><li>Small fix in the Enricher initialization</li></ul>\n\n<hr/>\n\n<h1>v10.0.6</h1>\n\n<ul><li>Small changes to enable compatibility with the Maestro module</li></ul>\n\n<hr/>\n\n<h1>v10.0.5</h1>\n\n<ul><li>Introducing a way to write fallout symbols in to the text fileds. Use &quot;@fos[DC]&quot; for DC die. Use @fos[PH], @fos[EN], @fos[PO], @fos[RA] for the damage types.</li></ul>\n\n<hr/>\n\n<h1>v10.0.4</h1>\n\n<ul><li>Added game settting for the initial carry capacity for characters and robots</li></ul>\n\n<hr/>\n\n<h1>v10.0.3</h1>\n\n<ul><li>Improved Condition status display</li><li>Added system.complication value (initially 20). This can be further modified by Active Effects</li><li>Weapons with unreliable quality now decrease Complication by 1 when you roll 2D20 from the weapon</li></ul>\n\n<hr/>\n\n<h1>v10.0.2</h1>\n\n<ul><li>Adding vicious damage effect in to the weapon damage calculation</li></ul>\n\n<hr/>\n\n<h1>v10.0.1</h1>\n\n<ul><li>Added Ammo Calculation</li><li>Added Weapon Quality labels in the 2d20 chat message</li><li>Cleared some old &quot;data&quot; instances</li></ul>\n\n<hr/>\n\n<h1>v10.0.0</h1>\n\n<ul><li>Compatibility update for Foundry v10</li></ul>\n\n<hr/>\n\n<h1>v9.0.6</h1>\n\n<ul><li>Fixed initial creation of caps and other valuables on Actor (Thanks to Haxxer)</li></ul>\n\n<hr/>\n\n<h1>v9.0.5</h1>\n\n<ul><li>Send item details to chat</li></ul>\n\n<hr/>\n\n<h1>v9.0.4</h1>\n\n<ul><li>Thanks to @e4g13 for making new images for the location die. Check out his cool fallout maps on http://www.patreon.com/e4g13</li></ul>\n\n<hr/>\n\n<h1>v9.0.3</h1>\n\n<ul><li>Introduced the &quot;Hit Location Die&quot; that is automatically rolled when clicking on the weapon. You can also roll it by using the &quot;h&quot; identifier. (eg. /r 1dh or as inline [[1dh]])</li><li>Added French translation</li></ul>\n\n<hr/>\n\n<h1>v9.0.2</h1>\n\n<ul><li>Setting added: &quot;Show Overseer&#39;s AP To Player&quot;</li><li>Setting added: &quot;Players Can Setup Party&#39;s Max AP&quot;</li></ul>\n\n<hr/>\n\n<h1>v9.0.1</h1>\n\n<ul><li>Added mouse hovers for weapon Qualities and Effects. You can change the page numbers for the actual descriptions by creating your own json file and pointing the system to it in the settings.</li></ul>\n\n<hr/>\n\n<h1>v9.0.0</h1>\n\n<ul><li>Bumping the manifest to Foundry v9</li></ul>\n\n<hr/>\n\n<h1>v1.9.1</h1>\n\n<ul><li>Weight of an Item can now be a float. (You can now put for example 0.2 as a weight)</li><li>Added Qualities and Effects to the Weapon List on the Character Sheet.</li><li>Fixed total value of the Challenge Die rolls when you use standard roll formula (/r 1dc).</li><li>Fixed quantity box so it doesn&#39;t disappear if the quantity is set to zero.</li></ul>\n\n<hr/>\n\n<h1>v1.9</h1>\n\n<ul><li>Added quantity filed next to the item name/</li><li>I am still trying to find and fix why sometimes the crit doesn&#39;t register and you get a wrong num of successes. I did put some safe measures around it but I still need more test data.</li></ul>\n\n<hr/>\n\n<h1>v1.8</h1>\n\n<ul><li>Added the &#39;Wear &amp; Tear&#39; field in the weapon sheet. If it is populated the &#39;wrench&#39; will apear next to the weapon name on the character sheet to remind you that you should fix it.</li></ul>\n\n<hr/>\n\n<h1>v1.7</h1>\n\n<ul><li>Radiation tracker added to the chracter sheet</li></ul>\n\n<hr/>\n\n<h1>v1.6</h1>\n\n<ul><li>Fixed encumbrance calculation. Now it should include item quantity too.</li></ul>\n\n<hr/>\n\n<h1>v1.5</h1>\n\n<ul><li>Added skill delete option for characters, and blocked skill duplication.</li></ul>\n\n<hr/>\n\n<h1>v1.4</h1>\n\n<ul><li>Fixed Book and Magazines Effect field</li></ul>\n\n<hr/>\n\n<h1>v1.3</h1>\n\n<ul><li>Added dice term for Combat Die. &quot;/r 1dc&quot;</li><li>Added Dice Modifier &quot;ef&quot; to count the effect results (5,6)</li><li>Added Dice Modifier &quot;sum&quot; to count the results (1+2+0+0+1+1)</li></ul>\n\n<hr/>\n\n<h1>v1.21</h1>\n\n<ul><li>Bug Fix: Show robot mod on the character sheet under &quot;unsorted items&quot;.</li></ul>\n\n<hr/>\n\n<h1>v1.2</h1>\n\n<ul><li>Merged Rosataker translation improvements.</li><li>Bug Fix: show the Perk Rank on the character sheet list.</li><li>Improvement: DC Roll Chat Message now displays weapon damage types and weapon damage effects.</li></ul>\n\n<hr/>\n\n<h1>v1.1</h1>\n\n<ul><li>Weapon Mods: Changed the weapon type field to be a text input so more specific weapon types can be entered.</li><li>Bug Fix: Items Sheet background bug fixed when installed on the Forge servers.</li></ul>",
		"format": 1
	},
	"title": {
		"level": 1,
		"show": false
	},
	"type": "text",
	"video": {
		"controls": true,
		"volume": 0.5
	}
}
